@extends('Front-end.Layout')
@section('content')
<?php
        // Retrieve the locale value from the session
        $locale = app()->getLocale();
?>
    <!-- Content title -->
    <div class="container mt-4">
        <div class="row">
            <div class="col-md-12 col-12 d-flex">
                <i class="icon-size-rps fa-solid fa-tree mg-r-10px color-blue-355fb6"></i>
                <h2 class="text-size-rps nav-font color-blue-355fb6 "  data-locale="{{ $locale }}">{{ __('messages.Structure of the National School of Local Administration') }}</h2>
            </div>
        </div>
        <div class="col-md-12 divider-line "></div>
      </div>
      <div class="row ">
        <div class="col-5 m-auto">
           <img src="{{ asset('images/image_2023-09-21_07-35-45.png') }}" alt="" width="100%">
        </div>
    </div>
    </div>
    {{-- <div class="container">
        <div class="row ">
            <div class="col-12 m-auto Kantumruy">
                <pre class="Kantumruy">
                        ១.នាយកដ្ឋានកិច្ចការទូទៅ មានតួនាទីជាសេនាធិការលើការងារគ្រប់គ្រងបុគ្គលិក រដ្ឋបាល និងហិរញ្ញវត្ថុដែលមានភារកិច្ចដូចខាងក្រោម៖
                    -	ការងាររដ្ឋបាល គ្រប់គ្រងត្រា លិខិតចេញចូល និងឯកសារនានា
                    -	រៀបចំកិច្ចប្រជុំ សិក្ខាសាលា និងកម្មវិធីផ្សេងៗ
                    -	ការងារគ្រប់គ្រងបុគ្គលិក
                    -	ការងារពិធីការ
                    -	គ្រប់គ្រងចំណូល និងចំណាយ ស្របតាមនីតិវិធីជាធរមាន
                    -	សម្របសម្រួលការងារលទ្ធកម្ម
                    -	ការងារសន្តិសុខ សណ្តាប់ធ្នាប់ សុវត្ថិភាព និងអនាម័យ
                    -	គ្រប់គ្រងបញ្ជីសារពើភណ្ឌ សម្ភារ បរិក្ខារ ចលនទ្រព្យ និងអចលនទ្រព្យ
                    -	គ្រប់គ្រងអាហារដ្ឋាន និងអន្តេវាសិកដ្ឋាន
                    -	ទទួលអនុវត្តភារកិច្ច និងសិទ្ធិផ្សេងៗទៀតដែលនាយកសាលាជាតិរដ្ឋបាលមូលដ្ឋានប្រគល់ឱ្យ។
                    ២.នាយកដ្ឋានបណ្តុះបណ្តាលមានតួនាទីជាសេនាធិការលើការងារបណ្តុះបណ្តាល ដែលមានភារកិច្ចដូចខាងក្រោម៖
                    -	អនុវត្តផែនការអភិវឌ្ឍន៍សមត្ថភាពរបស់សាលាជាតិរដ្ឋបាលមូលដ្ឋាន
                    -	សម្របសម្រួលជាមួយសាស្ត្រាចារ្យ គ្រូបណ្តុះបណ្តាល និងវាគ្មិនដទៃទៀត
                    -	ការងារចាត់បញ្ជូនមន្ត្រីចូលរួមការអភិវឌ្ឍសមត្ថភាពនៅក្នុងនិងក្រៅប្រទេស ក្នុងក្របខណ្ឌនៃសមត្ថកិច្ចរបស់សាលាជាតិរដ្ឋបាលមូលដ្ឋាន
                    -	គ្រប់គ្រងការងារពាក់ព័ន្ធសិក្ខាកាម សិស្ស និស្សិត
                    -	រៀបចំវិញ្ញាបនបត្របញ្ជាក់ការសិក្សា និងឬ សញ្ញាបត្រ ជូនសិក្ខាកាម និងឬ សិស្ស និស្សិត
                    -	ពិនិត្យ វាយតម្លៃ និងចេញលិខិតបញ្ជាក់ការសិក្សាជូនមន្ត្រីរាជការស៊ីវិលនៅទីស្តីការក្រសួងមហាផ្ទៃ និងនៅរដ្ឋបាលថ្នាក់ក្រោមជាតិ
                    -	សិក្សាស្រាវជ្រាវវិធីសាស្ត្រអភិវឌ្ឍន៍សមត្ថភាព
                    -	ចងក្រងឯកសារពាក់ព័ន្ធការបណ្តុះបណ្តាល
                    -	រៀបចំ និងគ្រប់គ្រងទិន្នន័យអភិវឌ្ឍន៍សមត្ថភាព
                    -	គ្រប់គ្រងសម្ភារឧបទេស និងបរិក្ខារសម្រាប់ការបណ្តុះបណ្តាល
                    -	តាមដាន គាំទ្រ និងផ្តល់អន្តរាគមន៍អភិវឌ្ឍន៍សមត្ថភាពដល់រដ្ឋបាលថ្នាក់ក្រោមជាតិ
                    -	តាមដានត្រួតពិនិត្យ វាយតម្លៃ និងគាំទ្រការអភិវឌ្ឍសមត្ថភាពនៅរដ្ឋបាលថ្នាក់ក្រោមជាតិ
                    -	ទទួលអនុវត្តភារកិច្ច និងសិទ្ធិផ្សេងៗទៀតដែលនាយកសាលាជាតិរដ្ឋបាលមូលដ្ឋានប្រគល់ឱ្យ។
                    ៣.នាយកដ្ឋានផែនការ និងកិច្ចសហប្រតិបត្តិការ មានតួនាទីជាសេនាធិការលើការងារផែនការ យុទ្ធសាស្ត្រ និងកិច្ចសហប្រតិបត្តិការ ដែលមានភារកិច្ចដូចខាងក្រោម៖
                    -	រៀបចំផែនការយុទ្ធសាស្ត្ររយៈពេលមធ្យម និងវែងរបស់សាលាជាតិរដ្ឋបាលមូលដ្ឋាន
                    -	រៀបចំផែនការសកម្មភាព និងថវិកាប្រចាំឆ្នាំរបស់សាលាជាតិរដ្ឋបាលមូលដ្ឋាន
                    -	រៀបចំ និងអភិវឌ្ឍយុទ្ធសាស្ត្រ កម្មវិធីសិក្សា និងកម្មវិធីនានារបស់សាលាជាតិរដ្ឋបាលមូលដ្ឋាន
                    -	ការងាររៀបចំ និងគ្រប់គ្រងគម្រោង
                    -	រៀបចំយុទ្ធសាស្រ្តនៃការប្រាស្រ័យទាក់ទង
                    -	សម្របសម្រួល និងស្វែងរកកិច្ចសហការជាមួយក្រសួង ស្ថាប័ន គ្រឹះស្ថានសិក្សា និងអ្នកពាក់ព័ន្ធនានាទាំងក្នុងនិងក្រៅប្រទេសលើការងារទស្សនកិច្ចសិក្សា កម្មវិធីផ្លាស់ប្តូរ កម្មសិក្សា សកម្មភាពសង្គម និងសកម្មភាពផ្សេងៗទៀត 
                    -	តាមដានត្រួតពិនិត្យ និងវាយតម្លៃការអនុវត្តផែនការរបស់សាលាជាតិរដ្ឋបាលមូលដ្ឋាន
                    -	រៀបចំរបាយការណ៍បូកសរុបលទ្ធផលការងារ និងទិសដៅបន្តរបស់សាលាជាតិរដ្ឋបាលមូលដ្ឋាន
                    ៤.នាយកដ្ឋានស្រាវជ្រាវ និងផ្សព្វផ្សាយ មានតួនាទីជាសេនាធិការលើការងារស្រាវជ្រាវ និងផ្សព្វផ្សាយ ដែលមានភារកិច្ចដូចខាងក្រោម៖
                    -	ផ្តួចផ្តើមរៀបចំ ចងក្រង និងផ្សព្វផ្សាយគោលនយោបាយ និងលិខិតបទដ្ឋានគតិយុត្តពាក់ព័ន្ធការអភិវឌ្ឍសមត្ថភាព និងអភិបាលកិច្ច
                    -	ស្រាវជ្រាវ និពន្ធ ចងក្រង និងផ្សព្វផ្សាយឯកសារ សៀវភៅពាក់ព័ន្ធអភិបាលកិច្ច ការអភិវឌ្ឍមូលដ្ឋាន ការលើកកម្ពស់ស្វ័យភាពមូលដ្ឋាន និងការគ្រប់គ្រងរដ្ឋបាលថ្នាក់ក្រោមជាតិ
                    -	រៀបចំ និងចងក្រងករណីសិក្សាបម្រើឱ្យការងារបណ្តុះបណ្តាល
                    -	តាមដាន វាយតម្លៃ និងលើកអនុសាសន៍ពាក់ព័ន្ធប្រព័ន្ធ ប្រសិទ្ធភាព និងគុណភាពនៃការអភិវឌ្ឍសមត្ថភាពនៅសាលាជាតិរដ្ឋបាលមូលដ្ឋាន និងនៅរដ្ឋបាលថ្នាក់ក្រោមជាតិ
                    -	តាមដាន វាយតម្លៃ និងលើកអនុសាសន៍ពាក់ព័ន្ធការអនុវត្តច្បាប់ លិខិតបទដ្ឋានគតិយុត្ដ និងគោលនយោបាយពាក់ព័ន្ធ
                    -	គ្រប់គ្រង និងធ្វើបច្ចុប្បន្នភាពគេហទំព័រ និងមធ្យោបាយទំនាក់ទំនងសង្គមរបស់សាលាជាតិរដ្ឋបាលមូលដ្ឋាន 
                    -	គ្រប់គ្រង និងគាំទ្រការងារព័ត៌មានវិទ្យារបស់សាលាជាតិរដ្ឋបាលមូលដ្ឋាន
                    -	ការងារគ្រប់គ្រងបណ្ណាល័យ និងបណ្ណសារដ្ឋាន 
                    -	ទទួលអនុវត្តភារកិច្ច និងសិទ្ធិផ្សេងៗទៀតដែលនាយកសាលាជាតិរដ្ឋបាលមូលដ្ឋានប្រគល់ឱ្យ។
                </pre>
                
                
            </div>
        </div>
    </div> --}}

@endsection